app/controllers/clinic_controller.rb

SELECT * FROM `location` WHERE (`location`.`location_id` = 721) AND (location.retired = 0)
SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
---
  def index

	  if session[:user_id].blank?
      reset_session

      user_login and return
    end

    Location.current = Location.find(params[:location_id] || session[:location_id]) rescue nil

    @location = Location.find(params[:location_id] || session[:location_id]) rescue nil

    session[:location_id] = @location.id if !@location.nil?

    redirect_to "/new_billing_account?patient_id=#{params[:ext_patient_id]}&user_id=#{params[:user_id]}&location_id=#{@location.id}" if !params[:ext_patient_id].nil?

    @project = get_global_property_value("project.name") rescue "Unknown"

    @facility = get_global_property_value("facility.name") rescue "Unknown"

    @patient_registration = get_global_property_value("patient.registration.url") rescue ""

    @link = get_global_property_value("user.management.url").to_s rescue nil

    @user = JSON.parse(RestClient.get("#{@link}/verify/#{(session[:user_id])}")) rescue {}

SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
---
  def project_users
    if !session[:user].nil?
      @user = session[:user]
    else
      @user = JSON.parse(RestClient.get("#{@link}/verify/#{(session[:user_id])}")) rescue {}

SELECT * FROM `user_property` WHERE (`user_property`.`property` = 'u5.activities') AND (`user_property`.`user_id` = 1) LIMIT 1
SELECT * FROM `users` WHERE (username LIKE '%' AND user_id IN (1)) AND (users.retired = 0) LIMIT 50
---
  def project_users_list
    users = User.find(:all, :conditions => ["username LIKE ? AND user_id IN (?)", "#{params[:username]}%",
        UserProperty.find(:all, :conditions => ["property = 'Status' AND property_value = 'ACTIVE'"]
        ).map{|user| user.user_id}], :limit => 50)