app/controllers/encounters_controller.rb

SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
SELECT * FROM `location` WHERE (`location`.`location_id` = 721) AND (location.retired = 0)
SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 175) AND (patient.voided = 0)
SELECT * FROM `encounter_type` WHERE (`encounter_type`.`name` = 'VITAMIN A SUPPLEMENTATION AND DE-WORMING SCHEDULE ') AND (encounter_type.retired = 0) LIMIT 1
INSERT INTO `encounter` (`voided`, `date_voided`, `date_changed`, `date_created`, `patient_id`, `provider_id`, `creator`, `changed_by`, `voided_by`, `void_reason`, `uuid`, `location_id`, `form_id`, `encounter_datetime`, `encounter_type`) VALUES(0, NULL, NULL, '2013-05-27 15:21:50', 175, 1, 1, NULL, NULL, NULL, '63d848ef-c6d0-11e2-a62e-30f9edafab3e', 721, NULL, '2013-05-27 15:21:50', 135)
SELECT * FROM `program_encounter` WHERE (patient_id = 175 AND DATE(date_time) = '2013-05-27') AND (`program_encounter`.`program_id` = 16) LIMIT 1
SELECT * FROM `program` WHERE (`program`.`concept_id` = 8885) AND (program.retired = 0) LIMIT 1
INSERT INTO `program_encounter` (`patient_id`, `program_id`, `date_time`) VALUES(175, 16, '2013-05-27 15:21:50')
INSERT INTO `program_encounter_details` (`voided`, `encounter_id`, `program_encounter_id`, `program_id`) VALUES(0, 1, 48, 16)
SELECT * FROM `patient_program` WHERE (patient_id = 175 AND COALESCE(date_completed, '') = '') AND ((patient_program.voided = 0) AND (`patient_program`.`program_id` = 16)) LIMIT 1
INSERT INTO `patient_program` (`date_changed`, `voided`, `date_voided`, `date_created`, `patient_id`, `date_enrolled`, `date_completed`, `creator`, `changed_by`, `voided_by`, `void_reason`, `uuid`, `location_id`, `program_id`) VALUES('2013-05-27 15:21:50', 0, NULL, '2013-05-27 15:21:50', 175, '2013-05-27 15:21:50', NULL, 1, 1, NULL, NULL, '63fa8696-c6d0-11e2-a62e-30f9edafab3e', NULL, 16)
---
def create

    User.current = User.find(@user["user_id"]) rescue nil

    Location.current = Location.find(params[:location_id] || session[:location_id]) rescue nil

    patient = Patient.find(params[:patient_id]) rescue nil

    if !patient.nil?

      type = EncounterType.find_by_name(params[:encounter_type]).id rescue nil

      if !type.nil?
        @encounter = Encounter.create(
          :patient_id => patient.id,
          :provider_id => (params[:user_id]),
          :encounter_type => type,
          :location_id => (session[:location_id] || params[:location_id])
        )

        @current = nil

        # raise @encounter.to_yaml

        if !params[:program].blank?

          @program = Program.find_by_concept_id(ConceptName.find_by_name(params[:program]).concept_id) rescue nil

          if !@program.nil?

            @program_encounter = ProgramEncounter.find_by_program_id(@program.id,
              :conditions => ["patient_id = ? AND DATE(date_time) = ?",
                patient.id, Date.today.strftime("%Y-%m-%d")])

            if @program_encounter.blank?

              @program_encounter = ProgramEncounter.create(
                :patient_id => patient.id,
                :date_time => Time.now,
                :program_id => @program.id
              )

            end

            ProgramEncounterDetail.create(
              :encounter_id => @encounter.id.to_i,
              :program_encounter_id => @program_encounter.id,
              :program_id => @program.id
            )

            @current = PatientProgram.find_by_program_id(@program.id,
              :conditions => ["patient_id = ? AND COALESCE(date_completed, '') = ''", patient.id])

            if @current.blank?

              @current = PatientProgram.create(
                :patient_id => patient.id,
                :program_id => @program.id,
                :date_enrolled => Time.now
              )

SELECT * FROM `encounter` WHERE (`encounter`.`encounter_id` = 1) AND (encounter.voided = 0)
---
  def list_observations
    obs = []

    obs = Encounter.find(params[:encounter_id]).observations.collect{|o|

SELECT * FROM `encounter` WHERE (`encounter`.`encounter_id` = 1) AND (encounter.voided = 0)
SELECT * FROM `program_encounter_details` WHERE (`program_encounter_details`.`encounter_id` = '1') AND (program_encounter_details.voided = 0) LIMIT 1
---
  def void
    prog = ProgramEncounterDetail.find_by_encounter_id(params[:encounter_id]) rescue nil

SELECT * FROM `encounter` WHERE (`encounter`.`encounter_id` = 1) AND (encounter.voided = 0)
SELECT * FROM `program_encounter` WHERE (`program_encounter`.`program_encounter_id` = 48)
---
  def list_encounters
    result = []

    program = ProgramEncounter.find(params[:program_id]) rescue nil