app/controllers/patients_controller.rb

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 174) AND (patient.voided = 0)
SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
---
  def show
    @patient = Patient.find(params[:id] || params[:patient_id]) rescue nil

    if @patient.nil?
      redirect_to "/encounters/no_patient" and return
    end

    if params[:user_id].nil?
      redirect_to "/encounters/no_user" and return
    end

    @user = User.find(params[:user_id]) rescue nil

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 174) AND (patient.voided = 0)
SELECT * FROM `encounter` WHERE (`encounter`.`encounter_id` = 1) AND (encounter.voided = 0)
SELECT * FROM `program_encounter` WHERE (`program_encounter`.`patient_id` = 174) AND ((DATE(date_time) = CURRENT_DATE()) AND (`program_encounter`.`patient_id` = 174))
SELECT * FROM `program` WHERE (`program`.`program_id` = 16) AND (program.retired = 0)
---
  def current_visit
    @patient = Patient.find(params[:id] || params[:patient_id]) rescue nil

    ProgramEncounter.current_date = (session[:date_time] || Time.now)

    @programs = @patient.program_encounters.current.collect{|p|

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 175) AND (patient.voided = 0)
SELECT * FROM `encounter` WHERE (`encounter`.`encounter_id` = 1) AND (encounter.voided = 0)
SELECT * FROM `program_encounter` WHERE (`program_encounter`.`patient_id` = 175) ORDER BY date_time DESC
SELECT * FROM `program` WHERE (`program`.`program_id` = 16) AND (program.retired = 0)
---
  def visit_history
    @patient = Patient.find(params[:id] || params[:patient_id]) rescue nil

    @programs = @patient.program_encounters.find(:all, :order => ["date_time DESC"]).collect{|p|

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 175) AND (patient.voided = 0)
---
  def baby_chart

    @patient = Patient.find(params[:id] || params[:patient_id]) rescue nil